
10`многострочный комментарий перед функцией
14 Убедитесь что значение этой переменной не является экземпляром String
20 текущее время в миллисекундах
21 Сравните 2 переменные
31 Интервалы и Таймауты
34 Добавьте еще один объект в массив
35 Переберите все собственные свойства объекта
36 Згенеруйте новое 4-значное случайное число
37 for .. in
38 if .. else" без использования "else
*******************************************************************************
39 Перебор элементов массива
40 Конвертация JSON в JavaScript объекты
41 Поиск объектов в массиве
42 Проверка сортировки массива
43 Сравнение двух массивов every
44 Поиск элементов примитивных типов в массиве
45 Поиск элементов в массивах includes
46 Добавление уникальных элементов в массив
47 Использование метода "reduce" для создания массива
48 Использование метода "reduce" для создания объекта
*******************************************************************************
49 Сортировка объектов в массиве
50 Шаблонные строки
51 Операторы "rest" (остаток) и "spread"
52 Параметры функции по умолчанию
53 Сокращенное написание свойств объектов
54 Деструктуризация массива
55 Деструктуризация результата функции
56 Деструктуризация объектов
74 Деструктуризация объектов
69 Деструктуризация объектов
70 Деструктуризация массивов и "rest" оператор
57 Трансформация массива объектов map
58 Удаление свойств объекта ...operator
*******************************************************************************
60 Модифицированный метод push для массивов
61 Сумма чисел for
65 Тернарный оператор typeof
67 Параметры функции по умолчанию
71 Spread Operator
72 Копия массива
73 Шаблонные строки
*******************************************************************************
75 Перебор символов строки
79 Перебор свойств объекта
76 Поменять местами значения двух переменных
77 Замыкания
59 class
78 classes
80 Сумма положительных и отрицательных чисел`
