/** ЗАДАЧА 31 - Интервалы и Таймауты
 *
 * Используйте следующие встроенные функции:
 * setTimeout дозволяє нам запускати функцію один раз через певний інтервал часу
 * setInterval виконує фрагмент коду з фіксованою затримкою між кожним викликом Цей метод повертає ідентифікатор інтервалу
 * clearInterval Скасує регулярне виконання функції
 *
 * Нужно вывести в консоль ТОЛЬКО 5 сообщений с интервалом 2 секунды:
 * "Сообщение номер 1"
 * "Сообщение номер 2"
 * "Сообщение номер 3"
 * "Сообщение номер 4"
 * "Сообщение номер 5"
 */
 //const setId = setTimeout(()=> console.log('message setim'), 2000)

 let i = 1
 
 const intervalId = setInterval(() => console.log('Сообщение номер', i++), 2000)
 
 setTimeout(() =>  clearInterval(intervalId) , 11000);
